package cmc15.backend.global;

public class Constants {
    public static final String[] BANNED_WORDS = {
            "간나", "갈보", "거지", "걸레", "게이", "고아", "고자", "과메기", "광녀", "괴물",
            "귓것", "그지깽깽이", "급식충", "김치녀", "깜둥이", "깝치다", "꺼벙이", "꺼져",
            "꼬라보다", "꼬붕", "꼭두각시", "꼰대", "꼴불견", "꼴통", "나가 죽어", "남창",
            "냄비", "녀석", "년", "노괴", "논다니", "놈", "뇌절", "눈 깔아", "늙은이",
            "니거", "니기미", "니미", "닥쳐", "대가리", "덜떨어지다", "되놈", "된장녀",
            "둘러대다", "뒈지다", "뒤지다", "듣보잡", "등신", "딸딸이", "또라이", "문재인",
            "문퀴벌레", "미친", "바보", "박쥐짓", "반푼이", "버러지", "벌레", "변태",
            "별창", "병신", "보빨러", "보슬아치", "보전깨", "보지", "보추", "부랄",
            "불알", "불한당", "븅딱", "비틱", "빌어먹을", "빠가", "빠구리", "빠돌이",
            "빠돼쌍", "빡추", "빨갱이", "빨통", "빻다", "뻐큐", "삐꾸", "사이버 렉카",
            "사이코", "삼엽충", "상판대기", "상폐녀", "새끼", "석녀", "설명충", "솔개",
            "쇼타콘", "수전노", "시발", "시부랄", "십장생", "쌍년", "쌍노무새끼", "쌍욕",
            "썅", "썩을", "씨댕", "씨발", "씨방", "씨벌탱", "씨부랄", "씨팔", "씹년",
            "씹덕", "씹새", "씹새끼", "씹쓰레기", "씹자식", "씹지랄", "씹창", "씹치남",
            "아가리", "아다", "아닥", "애미", "애비", "애비충", "애새끼", "애자",
            "앰흑", "양공주", "양놈", "어저미", "언년이", "얼간이", "에라이", "엠창",
            "열폭", "염병", "엿", "옌장", "옘병", "오랑캐", "오스트랄로피테쿠스", "오유충",
            "왜놈", "외퀴", "우라질", "우좀", "운지", "워마드", "육갑떨다", "육갑하다",
            "육변기", "육시랄", "이완용", "일베충", "자지", "잡놈", "잡종", "장뚜룸",
            "재수가 없다", "저능아", "전두환", "정박아", "정신병자", "젖", "제기랄",
            "제길", "조센징", "좆", "좌좀", "창남", "창녀", "창놈", "천치",
            "철면피", "촛불좀비", "추남", "추녀", "충", "칭챙총", "코쟁이", "코흘리개",
            "퀴", "토착빨갱이", "토착왜구", "토착짱깨", "통구이드립", "튀기", "트롤",
            "틀니딱딱충", "틀딱", "틀튜브", "파쇼", "폐급", "폐녀자", "폐인", "피싸개",
            "한남", "한남충", "한녀", "한녀충", "허섭스레기", "호랑말코", "호로",
            "호로자식", "호모", "화냥년", "환향녀", "후레자식", "후빨"
    };
}
